{
  "len": 17,
  "numSize":50,
  "padding": 20,
  "columns": 4,
  "vert": 30,
  "initZ": 2000,
  "borderRadius": "10px",
  "colors":["grey", "none", "white", "none", ],
  "content":[
      "<h1>About</h1><p>The website is entirely built using the <a href='http://famous.org'>Famous Engine</a>. Currently, I work as a Curriculum Software Engineer at Famous teaching both new and experienced developers how to work with our JavaScript library. I've helped write a lot of the documentation and I've build some of the lessons, but I haven't got a lot of time to develop much with the Engine besides some smaller demos. This was my chance.</p><p>Clicking each app icon will link you to various projects that I've worked on in the past. Many include projects from deprecated or unreleased versions of the Famous Engine. For those projects I have obscured the code, but if you would like to see the source code for this project check out the repo here: <a href='https://github.com/Morgantheplant/phonesite'>https://github.com/Morgantheplant/phonesite</a></p>",
      "<h1>Github</h1><img style='max-width: 155px;' src='images/morgantheplant.jpg' alt='morgantheplant's profile image' /><h4>Check out my GitHub page: <a href='https://github.com/morgantheplant'>https://github.com/morgantheplant</a></h4><p>Username: morgantheplant </p>", 
      "<h1>LinkedIn</h1><img style='max-width: 155px;' src='images/morgantheplant.jpg' alt='morgantheplant's profile image' /><h4>Check out my LinkedIn page: <a href='https://www.linkedin.com/in/morganplant'>https://www.linkedin.com/in/morganplant</a></h4>",
      "<h1>BLOG</h1><p>Coming soon..</p>", 
      "<h1>Copy</h1><p>Coming soon..</p>", 
      "<h1>Contact</h1><p>Coming soon..</p>", 
      "<h1>Settings</h1><p>Coming soon..</p>", 
      "Camera", 
      "<h1>Vectr</h1><a href=\"vectr\"><img src='images/vectr.png'alt='vectr project screen shot'/></a><p>Use the arrow keys to move the player and the spacebar to shoot bullets. The character is animated using image sprites I found on the internet and modified for this game.</p><p>I worked on this project in my spare time to teach myself how to use the Famous Physics Engine. In the process, I found a bug with removing bodies and collisions. I tried digging into the source to find the cause, but I got lost down a rabbit hole and decided to document and submit as an issue. I may go back and refactor this code for the latest API changes so I can create an actual game. This is written in an old version of the Engine, so most of it will need to be rewritten.</p>", 
      "<h1>LED</h1><a href=\"led\"><img src='images/led.png'alt='led project screen shot'/></a><p>I built this project on an unreleased functional reactive version of the Famous Engine (code named Yggdrasil). It was very interesting in that you provided your data model up top and this data flowed down into all of the views. While I liked this version, it was very difficult to conceptualize using it for large projects especially when keeping modulatity in mind. This version was eventually phased out for the entity component system/scene graph approach that we are using today.</p><p>This project was a test to see how many DOM elements I could animate on the screen. Enter your text into the green input field and then click the red button to see it on the LED board. The blue button changes the color. I believe the debounce function I wrote is very rudimentary so it may freak out if you press the red button a lot.</p>", 
      "<h1>BinSearch: TBYB</h1><a href=\"binsearch\"><img src='images/binsearch.png'alt='binsearch project screen shot'/></a><p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p> This is the second of three projects I created during my two week sprint. Using the now deprecated version of the Engine, I built this to teach the classic Binary Search algorithm. I wanted to make it feel like a game and tried to include some Candy Crush style animations. Note how I reused components from the other projects here. I built all of these with modularity and extensibilty in mind helping me complete all three projects within the two week deadline.</p>",
      "<h1>Binary: TBYB</h1><a href=\"binary\"><img src='images/binary.png'alt='binary project screen shot'/><</a>p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p>This is the first of three projects I created during my two week sprint. Here I use glowing cards to represent the digits in a byte. You can press play to start the animation or add a number into the input field. This is built using an old deprecated version of the Engine</p>", 
      "<h1>BubSort: TBYB</h1><a href=\"bubsort\"><img src='images/bubsort.png'alt='bubsort project screen shot'/></a><p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p>This is the third of three projects I created during my two week sprint. This is my favorite of the three projects. Each note is size based on its hertz and the colors change each time a note is compared against the next. This project uses the bubble sort algorithm to sort the notes in ascending order. The input field at the bottom lets you enter your own notes to be sorted or choose from some predefined tunes. I ran out of time before writing any code to clean up the strings from the input so there may be errors there. Again this was on a now deprecated version of the Engine and one of three projects built in 2 weeks (you may find some bugs).</p>", 
      "<h1>Videos</h1><p>In addition to writing a lot of the content, I've also recorded several videos and live streamed lessons to help developers learn how to use Famous. Here are some videos that are live now on the Famous YouTube channel<p><p>Boiler Plate Tutorial - Famous Mixed Mode: </p><iframe max-width='300px' height='250px' src=\"https://www.youtube.com/embed/1opVcuVEnns\" frameborder=\"0\" allowfullscreen></iframe></p><p>Famous Framework - Getting Started: <iframe max-width='300px' height='250px'  src=\"https://www.youtube.com/embed/hZsrHVzx4as\" frameborder=\"0\" allowfullscreen></iframe></p><p>Famous Framework: AppleTV tutorial 9 Video Series: <iframe max-width=\"300\" height=\"250\" src=\"https://www.youtube.com/embed/videoseries?list=PL0bvP7Hupz0QJNKPSx7JKbCgbJHdp66zr\" frameborder=\"0\" allowfullscreen></iframe></p>", 
      "<h1>PicCapsule</h1><p>Coming soon..</p>",
      "<h1>AppleTV</h1><a href=\"appletv\"><img src='images/appletv.png'alt='appletv project screen shot'/></a><p> A project and lesson I created for the Famous framework. I modified it here to ping my instagram account and update the images. It took me about a week to learn the Framework, build this project and write the copy for the lesson.</p>",
      "<h1>Calculator</h1><p>Coming soon..</p>"
      ],
  "iconText":["About", "GitHub", "LinkedIn", "BLOG", "Copy", "Contact", "Settings", "Camera", "Vectr", "LED", "BinSearch", "Binary", "BubSort", "Videos", "PicCapsule", "AppleTV","Calculator"],
  "classes":["About", "GitHub", "LinkedIn", "BLOG", "Copy", "Contact", "Settings", "Camera", "Vectr", "LED", "BinSearch", "Binary", "BubSort", "Videos", "PicCapsule", "Art","Calculator"],
  "links": {
    "github":"https://github.com/morgantheplant",
    "linkedin":"https://www.linkedin.com/in/morganplant"
  }
}