{
  "len": 17,
  "numSize":50,
  "padding": 20,
  "columns": 4,
  "vert": 30,
  "initZ": 2000,
  "borderRadius": "10px",
  "colors":["grey", "none", "white", "none", ],
  "content":[
      "<h1>About</h1><p>This website was build using the Famous Engine. I built it while working at Famous as a Curriculum Software Engineer where I taught both new and experienced developers how to use the JavaScript library.</p><p>Click on the various icons to visit some of the projects and demos that I worked on while at Famous. Since many of the projects feature deprecated or unreleased versions of the Engine I have obfuscated or hidden the code. However If you would like to see the code for this project you can check it out here: <a href=”https://github.com/Morgantheplant/phonesite” alt=”Morgan’s phonesite Github repo”>https://github.com/Morgantheplant/phonesite.</a></p>",
      "<h1>Github</h1><img style='max-width: 155px;' src='images/morgantheplant.jpg' alt='morgantheplant's profile image' /><h4>Check out my GitHub page: <a href='https://github.com/morgantheplant'>https://github.com/morgantheplant</a></h4><p>Username: morgantheplant </p>", 
      "<h1>LinkedIn</h1><img style='max-width: 155px;' src='images/morgantheplant.jpg' alt='morgantheplant's profile image' /><h4>Check out my LinkedIn page: <a href='https://www.linkedin.com/in/morganplant'>https://www.linkedin.com/in/morganplant</a></h4>",
      "<h1>BLOG</h1><p>Coming soon..</p>", 
      "<h1>Copy</h1><p>In addition to front-end development, I also have experience as both a technical writer and SEO copywriter. At Famous, I was responsible for writing and maintaining the lessons, guides, and tutorials. This involved diving into the source and figuring out the API’s myself, so I could better teach and write about what was going on under the hood.</p><p>Since the Engine was under constant change and development, I wrote and re-wrote the guides for each iteration of the Engine. Drawing on previous experience as a SEO copywriter, I was also able to beef up blog posts and optimize my self-recorded Famous University YouTube videos to maximize reach.</p><p><ul><li>See the Famous guides at: <a href=”http://famous.org/learn/”>http://famous.org/learn/</a></li><li>See my TBYB writing assignment at: <a href=”http://morgantheplant.com/mixedmode”>morgantheplant.com/mixedmode</a></li></ul></p>", 
      "<h1>Contact</h1><p>Please contact me through LinkedIn: <a href='https://www.linkedin.com/in/morganplant'>https://www.linkedin.com/in/morganplant</a></p>", 
      "<h1>Settings</h1><p>Stay tuned.. I may add ability to modify size and spacing of icons.</p><p>For now, check out the landing page for my TBYB proects here: <a href=\"TBYB\">morgantheplant.com/TBYB</a></p>", 
      "Camera", 
      "<h1>Vectr</h1><a href=\"vectr\"><img src='images/vectr.png'alt='vectr project screen shot'/></a><p>Use the arrow keys to move the player and the spacebar to shoot bullets. The character is animated using image sprites I found on the internet and modified for this game.</p><p>I worked on this project in my spare time to teach myself how to use the Famous Physics Engine. In the process, I found a bug with removing bodies and collisions. I tried digging into the source to find the cause, but I got lost down a rabbit hole and decided to document and submit as an issue. I may go back and refactor this code for the latest API changes so I can create an actual game. This is written in an old version of the Engine, so most of it will need to be rewritten.</p>", 
      "<h1>LED</h1><a href=\"led\"><img src='images/led.png'alt='led project screen shot'/></a><p>I built this project on an unreleased functional reactive version of the Famous Engine (code named Yggdrasil). It was very interesting in that you provided your data model up top and this data flowed down into all of the views. While I liked this version, it was very difficult to conceptualize using it for large projects especially when keeping modulatity in mind. This version was eventually phased out for the entity component system/scene graph approach that we are using today.</p><p>This project was a test to see how many DOM elements I could animate on the screen. Enter your text into the green input field and then click the red button to see it on the LED board. The blue button changes the color. I believe the debounce function I wrote is very rudimentary so it may freak out if you press the red button a lot.</p>", 
      "<h1>BinSearch: TBYB</h1><a href=\"binsearch\"><img src='images/binsearch.png'alt='binsearch project screen shot'/></a><p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p> This is the second of three projects I created during my two week sprint. Using the now deprecated version of the Engine, I built this to teach the classic Binary Search algorithm. I wanted to make it feel like a game and tried to include some Candy Crush style animations. Note how I reused components from the other projects here. I built all of these with modularity and extensibilty in mind helping me complete all three projects within the two week deadline.</p>",
      "<h1>Binary: TBYB</h1><a href=\"binary\"><img src='images/binary.png'alt='binary project screen shot'/></a><p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p>This is the first of three projects I created during my two week sprint. Here I use glowing cards to represent the digits in a byte. You can press play to start the animation or add a number into the input field. This is built using an old deprecated version of the Engine</p>", 
      "<h1>BubSort: TBYB</h1><a href=\"bubsort\"><img src='images/bubsort.png'alt='bubsort project screen shot'/></a><p>As part of the \"TBYB\" (i.e. Try Before You Buy) hiring process for Famous you are asked to complete a project relating to your position. Since I was opting for the Famous University position, I was givien an assignment to create visualizations that could help teach complex subects in a creative way.</p><p>This is the third of three projects I created during my two week sprint. This is my favorite of the three projects. Each note is size based on its hertz and the colors change each time a note is compared against the next. This project uses the bubble sort algorithm to sort the notes in ascending order. The input field at the bottom lets you enter your own notes to be sorted or choose from some predefined tunes. I ran out of time before writing any code to clean up the strings from the input so there may be errors there. Again this was on a now deprecated version of the Engine and one of three projects built in 2 weeks (you may find some bugs).</p>", 
      "<h1>Videos</h1><p>Teaching was a big part of my position as curriculum engineer at Famous. This included hosting live streams and recording YouTube videos to help teach developers the framework. Here are a couple of the select videos that are still posted</p><p>Boiler Plate Tutorial - Famous Mixed Mode: </p><p><iframe max-width='300px' height='250px' src=\"https://www.youtube.com/embed/1opVcuVEnns\" frameborder=\"0\" allowfullscreen></iframe></p><p>Famous Framework - Getting Started:</p><p><iframe max-width='300px' height='250px'  src=\"https://www.youtube.com/embed/hZsrHVzx4as\" frameborder=\"0\" allowfullscreen></iframe></p><p>Famous Framework: AppleTV tutorial 9 Video Series:</p><p><iframe max-width=\"300\" height=\"250\" src=\"https://www.youtube.com/embed/videoseries?list=PL0bvP7Hupz0QJNKPSx7JKbCgbJHdp66zr\" frameborder=\"0\" allowfullscreen></iframe></p>", 
      "<h1>Code Duel</h1><a href=\"http://codeduel.azurewebsites.net/\"><img src=\"images/codeduel.png\" alt=\"code duel project\"></a>​<p>This is a coding game using WebSockets that lets two players duke it out in a head to head challenge. I built this as a group project at Hack Reactor. More specifically, I integrated an SQL database with Angular to store and display high scores, challengers, time coding & the prompt. I also added crucial gameplay features including the room capacity logic, room to room broadcasting, the editor & timer</p>",
      "<h1>AppleTV</h1><a href=\"appletv\"><img src='images/appletv.png'alt='appletv project screen shot'/></a><p> A project and lesson I created for the Famous framework. I modified it here to ping my instagram account and update the images. It took me about a week to learn the Framework, build this project and write the copy for the lesson.</p>",
      "<h1>LED clock</h1><a href=\"LEDclock\"><img src=\"images/LEDclock.png\" alt=\"LED clock project\"></a><p>I built this one afternoon to practice using a requestAnimationFrame loop without Famous. This runs a simple update loop that changes the border style of several DIVs. This uses pure DOM, CSS and HTML. Check out the repo for it here: <a href=\"https://github.com/Morgantheplant/LEDclock\">https://github.com/Morgantheplant/LEDclock</a></p>"
      ],
  "iconText":["About", "GitHub", "LinkedIn", "BLOG", "Copy", "Contact", "Settings", "Camera", "Vectr", "LED", "BinSearch", "Binary", "BubSort", "Videos", "Code Duel", "AppleTV","LED clock"],
  "classes":["About", "GitHub", "LinkedIn", "BLOG", "Copy", "Contact", "Settings", "Camera", "Vectr", "LED", "BinSearch", "Binary", "BubSort", "Videos", "PicCapsule", "Art","Calculator"],
  "links": {
    "github":"https://github.com/morgantheplant",
    "linkedin":"https://www.linkedin.com/in/morganplant"
  }
}